Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/health_services_for_people_with_disabilities/regulation_residential_care_people_with_disabilities.html.txt.tmx
Source language: en
Languages: ga

source: Regulation of residential services for people with disabilities
ga: Rialú ar sheirbhísí cónaitheacha do dhaoine le míchumais

source: Residential services for people with disabilities are required to meet certain standards
ga: Ní foláir go sásaíonn na seirbhísí cónaitheacha do dhaoine le míchumais caighdeáin áirithe

source: These standards apply to residential services, including respite services, whether they are run by the Health Service Executive (HSE) or by other public, private or voluntary bodies that are funded or assisted by the HSE
ga: Bíonn feidhm leis na caighdeáin úd do sheirbhísí cónaitheacha, lena n-áirítear seirbhísí faoisimh, bídís i bhfeighil Fheidhmeannacht na Seirbhíse Sláinte (FSS) nó faoi stiúir comhlachtaí poiblí, príobháideach nó saorálacha eile a fhaigheann cistiú nó cúnamh ón FSS

source: The Health Information and Quality Authority (HIQA) is responsible for the registration and inspection of residential services for children and adults with disabilities
ga: Is é an tÚdarás um Fhaisnéis agus Cáilíocht Sláinte (HIQA) a bhíonn freagrach as clárú agus cigireacht na seirbhísí cónaitheacha do leanaí agus d’aosaigh le míchumais

source: All designated centres for people with disabilities are required to register with HIQA
ga: Ní mór do gach ionad ainmnithe do dhaoine le míchumais clárú le HIQA

source: Residential services are inspected against the National Standards for Residential Services for Children and Adults with Disabilities and are checked to ensure that they comply with regulations
ga: Déantar na seirbhísí cónaitheacha a imscrúdú os coinne na gCaighdeán Náisiúnta um Sheirbhísí Cónaitheacha do Leanaí agus Aosaigh le Míchumais, agus ceadaítear iad chun a chinntiú go gcloíonn siad leis na rialacháin

source: Reports are published after every inspection
ga: Foilsítear tuairiscí tar éis gach cigireacht

source: Inspection reports are available to download from the Health Information and Quality Authority’s website, hiqa.ie
ga: Bíonn tuairiscí cigireachta ar fáil lena n-íoslódáil ó láithreán gréasáin an tÚdarás um Fhaisnéis agus Cáilíocht Sláinte féin, hiqa.ie

source: The National Standards for Residential Services for Children and Adults with Disabilities outline what is expected of a provider of services and what a resident, their family, a carer, or the public can expect to receive in residential care settings for people with disabilities
ga: Is sna Caighdeáin Náisiúnta um Sheirbhísí Cónaitheacha do Leanaí agus Aosaigh le Míchumais a leagtar amach an méid a chaitheann soláthróir seirbhísí a dhéanamh, agus an méid ar féidir le cónaitheoir, lena dteaghlach, le cúramóir, nó leis an bpobal bheith ag dúil lena fháil sna suíomhanna cúraim chónaithigh do dhaoine le míchumais

source: The Standards are grouped under 8 key themes
ga: Rangaítear na Caighdeáin de réir 8 n-eochairthéama

source: The first 4 relate to quality and safety:
ga: Baineann na chéad cheithre cinn leis an gcáilíocht agus leis an tsábháilteacht:

source: • Individualised supports and care
ga: • Tacaíochtaí agus cúram don duine aonair

source: And 4 relate to capacity and capability:
ga: Agus baineann 4 acu le cumas agus le hacmhainn:

source: • Leadership, governance and management
ga: • Ceannaireacht, rialachas agus bainistiú

source: HIQA has published a guide to the Standards and there is an easy to read version of the Standards for adults, an easy to read version of the Standards for children and an audio version of the Standards
ga: Tá HIQA tar éis treoir do na Caighdeáin a fhoilsiú agus tá leagan soléite de na Caighdeáin d’aosaigh, leagan soiléite de na Caighdeáin do leanaí agus closleagan de na Caighdeáin ann

source: To be given a registration certificate to operate a residential service for people with disabilities, a service provider must show that it meets the relevant standards and legal requirements and is able to meet the needs of the residents
ga: Caitheann soláthróir seirbhíse a léiriú go sásaíonn sé na caighdeáin ábhartha agus na ceanglais dlíthiúla, agus gur féidir leis éilimh na gcónaitheoirí a shásamh chun is go dtugtar deimhniú clárúcháin dóibh chun seirbhís chónaitheach a fheidhmiú do dhaoine le míchumais

source: Services must register with HIQA and will be inspected to ensure that all services are of a consistently high quality
ga: Caitheann na seirbhísí clárú le HIQA agus déanfar cigireacht orthu chun a chinntiú go mbaineann ardcháilíocht sheasmhach leis na seirbhísí go léir

source: Services must re-register every 3 years
ga: Caitheann na seirbhísí athchlárú gach 3 bliana

source: Residential services will be inspected against the National Standards and against relevant legislation and regulations
ga: Déanfar cigireacht ar sheirbhísí cónaitheacha os coinne na gCaighdeán Náisiúnta agus os coinne na reachtaíochta agus na rialachán ábhartha

source: Inspections may be announced or unannounced and may be during the day, in the evenings, at weekends or at night
ga: Féadann na cigireachtaí bheith fógartha nó gan choinne, agus féadann siad tarlú isló, um thráthnóna, ag an deireadh seachtaine nó istoíche

source: During an inspection visit, inspectors talk to the children and adults who live in the residential service and their families and with managers, staff and interested people who wish to speak to them
ga: Labhraíonn na cigirí le linn cuairte cigireachta leis na leanaí agus na haosaigh a chónaíonn sa tseirbhís chónaitheach agus lena dteaghlaigh agus le bainisteoirí, baill foirne agus daoine leasmhara ar mian leo labhairt leo

source: Inspectors focus on the experience of the person living in the residential service and what it is like to live there
ga: Díríonn na cigirí ar thaithí an duine a chónaíonn sa tseirbhís chónaitheach agus ar an ngnáthshaol cónaitheach inti

source: They also observe daily routines, the quality of the accommodation and meals, and other aspects of daily life
ga: Breathnaíonn siad freisin ar ghnáthchúrsaí laethúla, cáilíocht na cóiríochta agus na mbéilí, agus ar ghnéithe eile den ghnáthshaol laethúil

source: If HIQA inspectors find that a service is unsafe, or the National Standards and regulations are not being met, it will have the legal power to take a number of actions in the interest of the residents
ga: Má cheapann cigirí HIQA gur contúirteach í an tseirbhís féin, nó nach mbítear ag sásamh na gCaighdeán Náisiúnta agus na rialachán, beidh an chumhacht dhlíthiúil acu chun glacadh le roinnt beart ar mhaithe leis na cónaitheoirí

source: These may include the addition of registration conditions, refusal to register the service, prosecution or cancellation of registration
ga: D’fhéadfaí áireamh leo sin cur coinníollacha clárúcháin leo, diúltú chun an tseirbhís a chlárú, ionchúiseamh nó cealú an chlárúcháin

source: Inspection reports are published on the HIQA website
ga: Foilsítear na tuairiscí cigireachta ar láithreán gréasáin HIQA

source: Inspection reports give information about the residential services, the number of places and the general facilities
ga: Tugtar eolas faoi na seirbhísí cónaitheacha, líon na n-ionad agus na saoráidí ginearálta sna tuairiscí cigireachta

source: The findings of the inspection are outlined, highlighting where standards of care are good and where improvements are required
ga: Tugtar achoimre ar thorthaí na cigireachta, ag léiriú na ndea-chaighdeán cúraim agus na ngnéithe óna dteastaíonn feabhsú

source: The report identifies any necessary actions that are required to be taken
ga: Aithnítear sa tuairisc aon bheart éigeantach a chaithfear a dhéanamh

source: You can provide information to HIQA if you have a concern about a service
ga: IS féidir leat eolas a sholáthar do HIQA má bhíonn tú buartha faoi sheirbhís éigin

source: HIQA has no legal remit to investigate specific complaints but all unsolicited information received is assessed and taken into account in its monitoring activities which could include, for example, requesting the service provider to carry out an investigation or provide information
ga: Níl aon sainchúram dlíthiúil ag HIQA chun gearáin sonracha a fhiosrú, ach déantar gach faisnéis gan iarraidh a mheasúnú agus a thabhairt san áireamh mar chuid dá ghníomhaíochtaí monatóireachta lena n-áireofaí mar shampla iarratas don soláthróir seirbhís chun fiosrúchán a dhéanamh nó chun faisnéis a sholáthar

source: HIQA provides an information leaflet about Responding to concerns in designated centres for children and adults with disabilities (pdf)
ga: Soláthraíonn HIQA bileog eolais um Freagra a thabhairt d’ábhair imní i lárionaid ainmnithe do leanaí agus aosaigh le míchumais (pdf)
